# 231226_콜백함수 탐구

In [60]:
import pandas as pd


# 과목별 평균 점수가 임계값을 초과하는지 확인하고 콜백 함수를 호출하는 함수
def check_group_average(df, group_column, value_column, threshold, callback):
    """
    DataFrame을 그룹화하고, 각 그룹의 평균 값이 임계값을 초과하는 경우 콜백 함수를 호출한다.
    :param df: DataFrame
    :param group_column: 그룹화할 열 이름
    :param value_column: 평균을 계산할 열 이름
    :param threshold: 임계값
    :param callback: 콜백 함수
    """
    grouped = df.groupby(group_column)
    for group_name, group_df in grouped:
        average = group_df[value_column].mean()
        if average > threshold:
            callback(group_name, average)

# 콜백 함수 정의
def print_group_average(group_name, average):
    """
    임계값을 초과하는 그룹의 평균 점수를 출력한다.
    :param group_name: 그룹 이름 (과목)
    :param average: 그룹의 평균 점수
    """
    print(f"{group_name} 과목의 평균 점수는 {average:.2f}점으로 임계값을 초과했습니다.")

# 함수 호출 및 콜백 함수 실행
threshold = 85
check_group_average(df, '과목', '점수', threshold, print_group_average)

수학 과목의 평균 점수는 85.75점으로 임계값을 초과했습니다.

In [61]:
# 새로운 샘플 데이터 프레임 생성
data = {
    '이름': ['김철수', '이영희', '박지민', '최예나', '김철수', '이영희', '박지민', '최예나'],
    '과목': ['수학', '수학', '수학', '수학', '영어', '영어', '영어', '영어'],
    '점수': [85, 92, 78, 88, 75, 80, 90, 85]
}
df = pd.DataFrame(data)

In [62]:
df

    이름  과목  점수
0  김철수  수학  85
1  이영희  수학  92
2  박지민  수학  78
3  최예나  수학  88
4  김철수  영어  75
5  이영희  영어  80
6  박지민  영어  90
7  최예나  영어  85

# 231214_판다스

In [58]:
df_1214 = pd.DataFrame(np.random.rand(6,3),    #데이터 랜덤생성
            columns=['a', 'b', 'c']  # 칼럼 이름만들기
            )

In [59]:
df_1214

          a         b         c
0  0.131726  0.921342  0.307065
1  0.841174  0.451704  0.936544
2  0.380572  0.703684  0.458147
3  0.625848  0.299461  0.001730
4  0.733736  0.441277  0.016002
5  0.229551  0.301106  0.203741

In [52]:
import numpy as np

# 231213_판다스 
- reindex()
- 필터링

In [34]:
df

     이름  나이  도시
0  John  28  서울
1  Jane  24  도쿄
2  Mike  22  뉴욕

In [50]:
# 데이터 프레임 필터링
df.loc[(df.나이 > 20)&(df.도시=='서울')]

     이름  나이  도시
0  John  28  서울

In [47]:
df.loc[(df['나이']>25)]

     이름  나이  도시
0  John  28  서울

# 231210_데이터 프레임 생성하기

## 가. 리스트-딕셔너리 사용하여 데이터 프레임 생성

In [31]:
import pandas as pd

# 데이터 프레임을 만들 데이터 정의
data = [{'이름': 'John', '나이': 28, '도시': '서울'},
        {'이름': 'Jane', '나이': 24, '도시': '도쿄'},
        {'이름': 'Mike', '나이': 22, '도시': '뉴욕'}]

# 데이터 프레임 생성
df = pd.DataFrame(data)

# 생성된 데이터 프레임 출력
print(df)

     이름  나이  도시
0  John  28  서울
1  Jane  24  도쿄
2  Mike  22  뉴욕

## 나. 리스트-리스트의 리스트를 사용한 데이터 프레임

In [32]:
### 리스트-딕셔너리 사용하여 데이터 프레임 생성
import pandas as pd

# 데이터 프레임을 만들 데이터 정의
data = [['John', 28, '서울'],
        ['Jane', 24, '도쿄'],
        ['Mike', 22, '뉴욕']]

# 데이터 프레임 생성
df = pd.DataFrame(data, columns=['이름', '나이', '도시'])

# 생성된 데이터 프레임 출력
print(df)

     이름  나이  도시
0  John  28  서울
1  Jane  24  도쿄
2  Mike  22  뉴욕

## 딕셔너리 - 리스트를 사용하여 데이터 프레임 생성하기

In [33]:

import pandas as pd

# 데이터 프레임을 만들 데이터 정의
data = {'이름': ['John', 'Jane', 'Mike'],
        '나이': [28, 24, 22],
        '도시': ['서울', '도쿄', '뉴욕']}

# 데이터 프레임 생성
df = pd.DataFrame(data)

# 생성된 데이터 프레임 출력
print(df)

     이름  나이  도시
0  John  28  서울
1  Jane  24  도쿄
2  Mike  22  뉴욕

# 231117_파이선 클래스 - 상속
- 엄청난 양의 코드를 효율적으로 사용하기 위함

In [26]:
# 클래스원본
class Person:
    def __init__(self, firstname, lastname):
        self.firstname = firstname
        self.lastname = lastname
        
    def name(self):
        return self.firstname + " " + self.lastname

# 노동자와 사용자 클래스
class Employee(Person):
    def __init__(self, firstname, lastname, staffId):
        # Person.__init__(self, firstname, lastname)  # 원본 클래스 가져오기, super()를 사용하면서 self는 생략가능
        super().__init__(firstname, lastname)
        self.staffId = staffId
    
    def info(self):
        return "Employee : " + self.name() + ", " \
                + str(self.staffId)
    
class Employer(Person):
    def __init__(self, firstname, lastname, position):
        # Person.__init__(self, firstname, lastname)
        super().__init__(firstname, lastname)  # super()를 사용하면서 self는 생략가능
        self.position = position
    
    def info(self):
        return "Employer : " + self.name() + ", "\
                + self.position

In [27]:
# 노동자와 사용자 만들기
worker = Employee("Sherlock", "Gmones", 1111)
cfo = Employer("James", "Kim", "CF)")

print(worker.info())
print(cfo.info())

Employee : Sherlock Gmones, 1111
Employer : James Kim, CF)

# 231114_파이선 클래스 변수

In [21]:
# 클래스의 변수 설정
class Circle:
    PI = 3.14
    def __init__(self, name, radius):
        self.name = name
        self.radius = radius

    # circle 클래스 변수 PI를 이용하여 면적 구하기
    def area(self):
        return Circle.PI * self.radius ** 2

In [22]:
c1 = Circle("C1", 4)
print("c1의 면적 : ", c1.area())

c1의 면적 :  50.24

# 231113_파이선 리스트 축약식 01
## 가. 노션링크
- https://951237.notion.site/1-7bb04c57477041d585c484368ea2a105?pvs=4

In [1]:
a = [x for x in range(10)]
a

[0, 1, 2, 3, 4, 5, 6, 7, 8, 9]

In [6]:
# 짝수 구하기
a = [x for x in range(10) if x % 2 == 0]
a

[0, 2, 4, 6, 8]

In [8]:
# 홀수 구하기
a = [x for x in range(10) if x % 2 == 1]
a

[1, 3, 5, 7, 9]

In [14]:
# 2와 3의 배수 구하기
a = [x for x in range(1, 31)
    if x % 2 ==0
    if x % 3 ==0]
a

[6, 12, 18, 24, 30]

# 231105_뉴스크롤링후 엑셀파일 저장
## 가. 노션링크
- https://951237.notion.site/5dabb592bcc14795bcca991d4715c413?pvs=4

## 나. 학습내용
### 사용라이브러리
- 셀레니움, openpyxl

### 알고리즘
- 셀레이움 실행
	- 키워드 입력
- 엑셀파일 생성
	- 헤드 생성(타이틀, 링크)
- 결과값 엑셀파일 저장
- 엑셀파일 이름 생성
	- 쿼리 파일 넣기
- 엑셀파일 저장

# 231104_윈도우 자동화 pywinauto

## 가. 노션링크
- https://951237.notion.site/pywinauto-5c1bef54d8114f368b84037c41a36fe4?pvs=4

## 나. 학습내용
- pyautogui는 매크로를 적용하기 위해서는 좌표를 알아야 함.
- pywinauto는 함수 혹은 클래스로 정리해놓음. 적용하기가 더 쉬움.
- 하지만, 모든 프로그램에 적용되는 것같지는 않음. 필요한 프로그램에 작동하는지 확인이 필요함.